In [66]:
import pandas as pd
import logging

logging.basicConfig(level=logging.INFO)

In [67]:
url = "https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes"

def scrape(url):
    logging.info(f"Scarping website with url : '{url}'...")
    return pd.read_html(url, header=None)

In [114]:
dfs=scrape(url)[1]
dfs  #cek valid for 2021

INFO:root:Scarping website with url : 'https://id.wikipedia.org/wiki/Daftar_miliarder_Forbes'...

,No.,Nama,Kekayaan bersih (USD),Usia,Kebangsaan,Sumber kekayaan
0,NaN,Jeff Bezos,$177 miliar,57,Amerika Serikat,Amazon
1,NaN,Elon Musk,$151 miliar,49,Amerika Serikat,"Tesla, SpaceX"
2,NaN,Bernard Arnault & keluarga,$150 miliar,72,Prancis,LVMH
3,NaN,Bill Gates,$124 miliar,65,Amerika Serikat,Microsoft
4,NaN,Mark Zuckerberg,$97 miliar,36,Amerika Serikat,Meta Platforms
5,NaN,Warren Buffett,$96 miliar,90,Amerika Serikat,Berkshire Hathaway
6,NaN,Larry Ellison,$93 miliar,76,Amerika Serikat,Oracle Corporation
7,NaN,Larry Page,$91.5 miliar,48,Amerika Serikat,Alphabet Inc.
8,NaN,Sergey Brin,$89 miliar,47,Amerika Serikat,Alphabet Inc.
9,NaN,Mukesh Ambani,$84.5 miliar,63,India,Reliance Industries

In [116]:
dfs['No Urut'] = range(1, len(dfs) + 1)   # add collum index since collumn 'No Urut' can't read(NaN) => for easy reading

In [106]:
import re


#dfs['Kekayaan bersih (USD)']=dfs['Kekayaan bersih (USD)'].str[1:]



def is_money_miliar(string_money):
  return string_money.lower().endswith('miliar')
def transform_money_format(string_money):
  half_clean_string=string_money.lower().replace(",",".").replace(" ","")
  return re.sub(r"[?\[M\]miliar|\[J\]juta]","",half_clean_string)

def transform(df, tahun):
  logging.info("Transforming Dataframe...")

  collums_mapping ={
      'No Urut' : "nomor_urut",
      'Nama':'nama',
      'Kekayaan bersih (USD)':'kekayaan_bersih_usd',
      
      'Usia':'usia',
      'Kebangsaan':'kebangsaan',
      'Sumber kekayaan':'sumber_kekayaan',
  }
  
  #mengganti nama collumn sesuai kebutuhan
  renamed_df = df.rename(columns=collums_mapping)


  #mengganti column tahun dan memberinya value yang berasal dari parameter tahun
  renamed_df['tahun']=tahun

  renamed_df['kekayaan_bersih_usd_juta']=renamed_df['kekayaan_bersih_usd'].str[1:].apply(
      lambda value:float(transform_money_format(value)) * 1000 if is_money_miliar(value) else float (transform_money_format(value))
  )
  return renamed_df[["nomor_urut","nama","tahun","kebangsaan","usia","kekayaan_bersih_usd_juta","sumber_kekayaan"]]

In [111]:
df_2021 = transform(dfs, 2021)
df_2021

INFO:root:Transforming Dataframe...

,nomor_urut,nama,tahun,kebangsaan,usia,kekayaan_bersih_usd_juta,sumber_kekayaan
0,1,Jeff Bezos,2021,Amerika Serikat,57,177000.0,Amazon
1,2,Elon Musk,2021,Amerika Serikat,49,151000.0,"Tesla, SpaceX"
2,3,Bernard Arnault & keluarga,2021,Prancis,72,150000.0,LVMH
3,4,Bill Gates,2021,Amerika Serikat,65,124000.0,Microsoft
4,5,Mark Zuckerberg,2021,Amerika Serikat,36,97000.0,Meta Platforms
5,6,Warren Buffett,2021,Amerika Serikat,90,96000.0,Berkshire Hathaway
6,7,Larry Ellison,2021,Amerika Serikat,76,93000.0,Oracle Corporation
7,8,Larry Page,2021,Amerika Serikat,48,91500.0,Alphabet Inc.
8,9,Sergey Brin,2021,Amerika Serikat,47,89000.0,Alphabet Inc.
9,10,Mukesh Ambani,2021,India,63,84500.0,Reliance Industries

In [85]:
pip install psycopg2-binary==2.8.6

Requirement already satisfied: psycopg2-binary==2.8.6 in c:\users\jilli\appdata\local\programs\python\python39\lib\site-packages (2.8.6)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.4; however, version 22.0.3 is available.
You should consider upgrading via the 'C:\Users\jilli\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [88]:
from sqlalchemy import create_engine

In [96]:
DB_NAME = "postgres"
DB_USER = "user1"
DB_PASSWORD = "user1"
DB_HOST = "104.197.148.144"
DB_PORT = "5432"
CONNECTION_STRING = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"
TABLE_NAME = "jilli_orang_terkaya_forbes"

In [92]:
CONNECTION_STRING

'postgresql://user1:user1@104.197.148.144:5432/postgres'

In [94]:
def write_to_postgres(df, db_name, table_name, connection_string):
    engine = create_engine(connection_string)
    logging.info(f"Writing dataframe to database: '{db_name}', table: '{table_name}' ...")
    df.to_sql(name = table_name, con=engine, if_exists="replace", index=False)

In [110]:
write_to_postgres(df=df_2021, db_name=DB_NAME, table_name=TABLE_NAME, connection_string=CONNECTION_STRING)

INFO:root:Writing dataframe to database: 'postgres', table: 'jilli_orang_terkaya_forbes' ...